[
    {
        "clean_text": "What is SaaS? - Software as a Service Explained - AWS Select your cookie preferences We use essential cookies and similar tools that are necessary to provide our site and services. We use performance cookies to collect anonymous statistics, so we can understand how customers use our site and make improvements. Essential cookies cannot be deactivated, but you can choose “Customize” or “Decline” to decline performance cookies. If you agree, AWS and approved third parties will also use cookies to provide useful site features, remember your preferences, and display relevant content, including relevant advertising. To accept or decline all non-essential cookies, choose “Accept” or “Decline.” To make more detailed choices, choose “Customize.” Accept Decline Customize Customize cookie preferences We use cookies and similar tools (collectively, \"cookies\") for the following purposes. Essential Essential cookies are necessary to provide our site and services and cannot be deactivated. They are usually set in response to your actions on the site, such as setting your privacy preferences, signing in, or filling in forms. Performance Performance cookies provide anonymous statistics about how customers navigate our site so we can improve site experience and performance. Approved third parties may perform analytics on our behalf, but they cannot use the data for their own purposes. Allowed Functional Functional cookies help us provide useful site features, remember your preferences, and display relevant content. Approved third parties may set these cookies to provide certain site features. If you do not allow these cookies, then some or all of these services may not function properly. Allowed Advertising Advertising cookies may be set through our site by us or our advertising partners and help us deliver relevant marketing content. If you do not allow these cookies, you will experience less relevant advertising. Allowed Blocking some types of cookies may impact your experience of our sites. You may review and change your choices at any time by selecting Cookie preferences in the footer of this site. We and selected third-parties use cookies or similar technologies as specified in the AWS Cookie Notice . Cancel Save preferences Your privacy choices We and our advertising partners (“we”) may use information we collect from or about you to show you ads on other websites and online services. Under certain laws, this activity is referred to as “cross-context behavioral advertising” or “targeted advertising.” To opt out of our use of cookies or similar technologies to engage in these activities, select “Opt out of cross-context behavioral ads” and “Save preferences” below. If you clear your browser cookies or visit this site from a different device or browser, you will need to make your selection again. For more information about cookies and how we use them, read our Cookie Notice . Allow cross-context behavioral ads Opt out of cross-context behavioral ads To opt out of the use of other identifiers, such as contact information, for these activities, fill out the form here . For more information about how AWS handles your information, read the AWS Privacy Notice . Cancel Save preferences Unable to save cookie preferences We will only store essential cookies at this time, because we were unable to save your cookie preferences. If you want to change your cookie preferences, try again later using the link in the AWS console footer, or contact support if the problem persists. Dismiss Skip to main content Feedback What is Cloud Computing? › Cloud Computing Concepts Hub › End-User Computing (EUC) › What is SaaS (Software as a Service)? What is SaaS (Software as a Service)? Create an AWS Account Page topics What is SaaS? Why is SaaS important? How does SaaS work? What are some commonly used SaaS applications? How does SaaS compare with other traditional cloud services models? What are some examples of SaaS use cases built with AWS? Why should I choose AWS to build SaaS applications? What is SaaS? Software as a Service (SaaS) is traditionally considered a cloud-based software model that delivers applications to end-users through an internet browser. SaaS vendors host services and applications for customers to access on-demand. With a SaaS offering, you do not have to think about how the service is maintained or how the underlying infrastructure is managed; you only need to think about how you will use the software. Another typical aspect of a SaaS model is pricing that's paid on a subscription or pay-as-you-use model, instead of purchasing all functionality at once in one big chunk. A common example of a SaaS application is a third-party web-based email application, where you can send and receive emails without having to manage feature additions to the email product or maintain the servers and operating systems that the email program is running on. While the industry has traditional used terms like Infrastructure as a Service (IaaS), Platform as a Service (PaaS) and Software as a Service (SaaS) have been used as service groups, at AWS, we focus on solutions to your needs, which can span many service types. This page uses the traditional service grouping of IaaS, PaaS, and SaaS to help you decide which set is right for your needs and the deployment strategy that works best for you. Why is SaaS important? SaaS is important because it gives businesses access to powerful software that would previously have been too expensive or energy-intensive to run from on-premises environments. The SaaS vendor manages the hardware, the software tools, and the application in its own data center or cloud environment. You can access the software directly from the browser or mobile application. The subscription-based model of SaaS also means you can scale your use of software up or down as your business needs it. Some benefits of SaaS are below. Cloud accessibility You can access your SaaS from any device with an internet connection. Under more traditional software models, you could only access business applications from the workstations on which they were installed. This accessibility is increasingly in-demand because of hybrid and home working models. Lower upfront costs SaaS vendors typically offer a subscription-based model that reduces upfront costs of traditional software such as licenses, installation, or infrastructure management. There is also no need to invest in additional computing resources to run the software, as the vendor manages everything on its servers. Reduced ongoing costs As the SaaS vendor charges a standard fee, you can confidently plan how much your software services will cost per annum. Ongoing maintenance is overseen by your SaaS providers and covered by your subscription. You'll also avoid paying for increased server capacity if you need to scale up your SaaS solution. Rapid deployment SaaS eliminates the installation and configuration associated with on-premises software, meaning you can roll out software across your business as soon as your enterprise subscription begins. On-demand scalability SaaS allows you to easily add more services or storage to your subscription as needed without incurring the costs of upgrading your infrastructure. The scalability of SaaS is perfect for businesses that are growing quickly, as they can add new features and users when it suits them. Reliability SaaS vendors invest in rigorous cybersecurity protocols and disaster recovery capabilities. Many SaaS vendors promise 99% or even 99.9% uptime, meaning all you need in order to work is a reliable internet connection. Automatic updates Software vendors regularly make incremental updates and security patches to their software. Updates can be set to deploy automatically without the need for IT support. Integration You can integrate third-party SaaS applications with other platforms and systems using APIs . You can customize the software to suit your particular requirements without infrastructure costs. Real-time data and analytics SaaS applications often collect data regarding usage and performance, and can offer insights in real-time. How does SaaS work? Software as a Service works through a cloud delivery model. SaaS vendors commonly host applications and data on their own servers and databases , or utilize the servers of a third-party cloud provider. SaaS vendors also manage platforms, operating systems, and middleware. Once you subscribe to a SaaS solution, the SaaS vendor grants the customer access to the application through web browser user registration and login. SaaS vendors usually adopt a multi-tenant model, meaning a single version of the SaaS solution will be hosted on the vendor's servers and provided to individual subscribers. Service level agreement A service level agreement (SLA) is a legal contract that sets the terms and conditions of using the SaaS product. It covers what your SaaS vendor offers and service expectations such as uptime, security, support, and automatic updates, while also outlining your responsibilities as a client. For example, most businesses need to own their data regardless of where their information is held. A standard SLA will confirm in writing that your company retains ownership of its data and your right to retrieve it at any time. In the vast majority of cases, you can download your data and back it up locally at any point. Read more about service level agreements (SLA) What are some commonly used SaaS applications? There are several commonly used types of SaaS applications, including: Customer Relationship Management ( CRM ) Enterprise Resource Planning ( ERP ) Email marketing software Accounting software Human resources software Security software Collaboration tools Document editing services Communication software Contact Center software How does SaaS compare with other traditional cloud services models? SaaS is one of three main traditional models for cloud computing , alongside Platform as a Service (PaaS) and Infrastructure as a Service (IaaS). Platform as a Service Platform as a Service provides hardware and software infrastructure for constructing and maintaining applications typically through APIs. Cloud providers host hardware and software development tools in their data centers. With PaaS, you can build, test, run, and scale applications faster and at a lower cost. Learn more about Integration Platform as a Service (iPaaS) SaaS vs. PaaS Whereas SaaS is used to do specific tasks, PaaS gives you access to managed infrastructure for application development. Infrastructure as a Service Infrastructure as a Service (IaaS) provides services for networking, computers (virtually or physically), and data storage. Using IaaS delivers the highest level of flexibility and management control over your IT resources, and is similar to existing IT resources. Learn more about Infrastructure as a Service (IaaS) SaaS vs. IaaS SaaS offers the most comprehensive third-party software and maintenance choice, whereas IaaS only supplies and maintains core components such as servers or storage. IaaS is considered a favorable option if you want maximum control of your environment, while SaaS is preferable if you're looking for ease of use. What are some examples of SaaS use cases built with AWS? Third-party SaaS applications can be built and run on cloud infrastructure. Several leading enterprises use AWS to build SaaS applications. They include: BMC Software U.S. multinational IT services organization BMC Software worked with AWS to develop a SaaS version of Control-M. One of its longest-standing offerings, Control-M simplifies application and data workflow orchestration. BMC enlisted the expertise of AWS SaaS Factory to provide insight into developing the SaaS solution. AWS also offered advice that optimized costs while improving business agility and operational efficiencies. CyberArk CyberArk's Identity Security Platform helps businesses to solve challenges caused by remote working, such as remote access management, administration rights, and security credentials. Working with the AWS SaaS Factory team, CyberArk built new shared services for its platform. CyberArk was able to validate and accelerate SaaS development by building centralized, cloud-native shared services for all of its SaaS solutions and reduced its time to market by 30%. Cohesity AWS Advanced Technology partner Cohesity released its Data Management as a Service (DMaaS) on AWS to radically simplify data management. Cohesity worked closely with several AWS teams, including AWS SaaS Factory, to design, implement, and launch its product. As a result, it reported a 50% acceleration in time to market. Why should I choose AWS to build SaaS applications? Though AWS does not offer SaaS services, AWS offers many options you can use to build custom third-party SaaS applications and solutions. You can access a number of tools and resources to drive your SaaS transformation. Build your organizational, operational, and technical capabilities with AWS best practices and expertise. AWS Partners can access third-party, expert SaaS resources with AWS SaaS Factory to help at every stage of the SaaS journey. Get started with AWS by creating a free account today! Next steps on AWS Check out additional product-related resources View free offers for End User Computing services in the cloud Sign up for a free account Instantly get access to the AWS free tier. Sign up Start building in the console Get started building in the AWS Management Console. Sign in",
        "h1_list": [
            "What is SaaS (Software as a Service)?"
        ],
        "h2_list": [
            "Select your cookie preferences",
            "Page topics",
            "What is SaaS?",
            "Why is SaaS important?",
            "How does SaaS work?",
            "What are some commonly used SaaS applications?",
            "How does SaaS compare with other traditional cloud services models?",
            "What are some examples of SaaS use cases built with AWS?",
            "Why should I choose AWS to build SaaS applications?",
            "Next steps on AWS"
        ],
        "h3_list": [
            "Essential",
            "Performance",
            "Functional",
            "Advertising",
            "Cloud accessibility",
            "Lower upfront costs",
            "Reduced ongoing costs",
            "Rapid deployment",
            "On-demand scalability",
            "Reliability",
            "Automatic updates",
            "Integration",
            "Real-time data and analytics",
            "Service level agreement",
            "Platform as a Service",
            "Infrastructure as a Service",
            "BMC Software",
            "CyberArk",
            "Cohesity",
            "Check out additional product-related resources",
            "Sign up for a free account",
            "Start building in the console"
        ]
    }
]