[
    {
        "clean_text": "Software as a service - Wikipedia Jump to content Participate in Wiki Loves Punjab 2026 (Let's document Visuals from Villages of Punjab) From Wikipedia, the free encyclopedia Category of cloud computing \"SaaS\" redirects here; not to be confused with Security as a service . Software as a service ( SaaS / s æ s / [ 1 ] ) is a cloud computing service model in which a provider delivers application software to clients while managing the required physical and software resources. [ 2 ] SaaS applications are accessed via either a web application or locally-installed software . Unlike other software delivery models, SaaS separates \"the possession and ownership of software from its use.\" [ 3 ] SaaS use began around 2000, and by 2023 was the main form of software application deployment. Unlike most self-hosted software products, only one version of the software exists [ citation needed ] and only one operating system and configuration is supported. SaaS products typically run on rented infrastructure as a service (IaaS) or platform as a service (PaaS) systems including hardware and sometimes operating systems and middleware , to accommodate rapid increases in usage while providing instant and continuous availability to customers. SaaS customers have the abstraction of limitless computing resources, while economy of scale drives down the cost. SaaS architectures are typically multi-tenant ; usually they share resources between clients for efficiency, but sometimes they offer a siloed environment for an additional fee. Common SaaS revenue models include freemium , subscription , and usage-based fees. Unlike traditional software, it is rarely possible to buy a perpetual license for a certain version of the software. There are no specific software development practices that distinguish SaaS from other application development, although there is often a focus on frequent testing and releases. Cloud computing [ edit ] Main article: Cloud computing Comparison of on-premise, IaaS, PaaS, and SaaS Infrastructure as a service (IaaS) is the most basic form of cloud computing , where infrastructure resources—such as physical computers—are not owned by the user but instead leased from a cloud provider. [ 4 ] As a result, infrastructure resources can be increased rapidly, instead of waiting weeks for computers to ship and set up. IaaS requires time and expertise to make use of the infrastructure in the form of operating systems and applications . [ 5 ] Platform as a service (PaaS) includes the operating system and middleware , but not the applications. [ 6 ] [ 7 ] SaaS providers typically use PaaS or IaaS services to run their applications. [ 6 ] Without IaaS, it would be extremely difficult to make an SaaS product scalable for a variable number of users while providing the instant and continual availability that customers expect. [ 8 ] Most end users consume only the SaaS product and do not have to worry about the technical complexity of the physical hardware and operating system. [ 9 ] Because cloud resources can be accessed without any human interactions, SaaS customers are provided with the abstraction of limitless computing resources, while economy of scale drives down the cost. [ 10 ] Another key feature of cloud computing is that software updates can be rolled out and made available to all customers nearly instantaneously. [ 11 ] In 2019, SaaS was estimated to make up the plurality, 43 percent, of the cloud computing market while IaaS and PaaS combined account for approximately 25 percent. [ 12 ] History [ edit ] In the 1960s, multitasking was invented, enabling mainframe computers to serve multiple users simultaneously. [ 13 ] Over the next decade, timesharing became the main business model for computing, and cluster computing enabled multiple computers to work together. [ 10 ] Cloud computing emerged in the late 1990s with companies like Amazon (1994), Salesforce (1999), and Concur (1993) offering Internet -based applications on a pay-per-use basis. All of these focused on a single product to seize a high market share . [ 14 ] Beginning with Gmail in 2004, email services were some of the first SaaS products to be mass-marketed to consumers. [ 15 ] The market for SaaS grew rapidly throughout the early twenty-first century. [ 16 ] [ 12 ] Initially viewed as a technological innovation, SaaS has come to be perceived more as a business model. [ 17 ] By 2023, SaaS had become the primary method that companies deliver applications. [ 18 ] Popular consumer SaaS products include all social media websites, email services like Gmail and its associated Google Docs Editors , [ 19 ] Zoom , Dropbox , [ 20 ] and entertainment products like Netflix and Spotify . [ 21 ] Enterprise SaaS products include Salesforce 's customer relationship management (CRM) software, SAP Cloud Platform , and Oracle Cloud Enterprise Resource Planning . [ 20 ] Revenue models [ edit ] Some SaaS providers offer free services to consumers that are funded by means such as advertising , affiliate marketing , or selling consumer data. [ 22 ] One of the most popular models for Internet start-ups and mobile apps is freemium , where the company charges for continued use or a higher level of service. [ 23 ] Even if the user never upgrades to the paid version, it helps the company capture a higher market share and displace customers from a rival. [ 24 ] However, the company's hosting cost increases with the number of users, regardless of whether it is successful at enticing them to use the paid version. [ 25 ] Another common model is where the free version only provides demonstration ( crippleware ). Online marketplaces may charge a fee on transactions to cover the SaaS provider costs. [ 22 ] It used to be more common for SaaS products to be offered for a one-time cost, but this model is declining in popularity. [ 22 ] A few [ 22 ] SaaS products have open source code, called open SaaS. This model can provide advantages such as reduced deployment cost, less vendor commitment, and more portable applications. [ 26 ] The most common SaaS revenue models involve subscription and pay for usage. [ 27 ] For customers, the advantages include reduced upfront cost, increased flexibility, and lower overall cost compared to traditional software with perpetual software licenses . [ 28 ] In some cases, the steep one-time cost demanded by sellers of traditional software were out of the reach of smaller businesses , but pay-per-use SaaS models makes the software affordable. [ 3 ] Usage may be charged based on the number of users, transactions, amount of storage spaced used, or other metrics. [ 29 ] Many buyers prefer pay-per-usage because they believe that they are relatively light users of the software, and the seller benefits by reaching occasional users who would otherwise not buy the software. [ 29 ] However, it can cause revenue uncertainty for the seller and increases the overhead for billing . [ 30 ] The subscription model of SaaS offers a continuing and renewable revenue stream to the provider, although vulnerable to cancellation. [ 3 ] If a significant number are cancelled, the viability of the business can be placed in jeopardy. [ 3 ] The ease of canceling a subscription and switching to a competitor leave customers with the leverage to get concessions from the seller. [ 31 ] While recurring revenues can help the business and attract investors, the need for customer service skills in convincing the customer to renew their subscription is a challenge for providers switching to subscription from other revenue models. [ 32 ] Adoption [ edit ] SaaS products are typically accessed via a web browser as a publicly available web application . [ 33 ] [ 18 ] This means that customers can access the application anywhere from any device without needing to install or update it. [ 18 ] [ 34 ] SaaS providers often try to minimize the difficulty of signing up for the product. [ 35 ] Many capitalize on the service-oriented structure to respond to customer feedback and evolve their product quickly to meet demands. This can enable customers to believe in the continued improvement of the product and help the SaaS provider get customers from an established traditional software company that likely can offer a deeper feature set. [ 36 ] [ 37 ] Although on-premises software is often less secure than SaaS alternatives, [ 38 ] security and privacy are among the main reasons cited by companies that do not adopt SaaS products. [ 39 ] SaaS companies have to protect their publicly available offerings from abuse, including denial-of-service attacks and hacking. [ 40 ] They often use technologies such as access control , authentication , and encryption to protect data confidentiality . [ 39 ] Nevertheless, not all companies trust SaaS providers to keep sensitive data secured. [ 39 ] The vendor is responsible for software updates , including security patches , and for protecting the customers' data. [ 34 ] SaaS systems inherently have a greater latency than software run on-premises due to the time for network packets to be delivered to the cloud facility. This can be prohibitive for some uses, such as time-sensitive industrial processes or warehousing. [ 41 ] The rise of SaaS products is one factor that has led many companies to shift IT budgets from capital expenditure to operating expenditure . [ 42 ] The process of migration to SaaS and supporting it can also be a significant cost that must be accounted for. [ 43 ] [ 32 ] Development [ edit ] A SaaS architecture. All customers are running the same version of the software on the same platform. [ 44 ] A challenge for SaaS providers is that demand is not known in advance. Their system must have enough slack to be able to handle all users without turning any away, but without paying for too many resources that will be unnecessary. If resources are static, they are guaranteed to be wasted during non-peak time. [ 45 ] Sometimes cheaper off-peak rates are offered to balance the load and reduce waste. [ 46 ] The expectation for continuous service is so high that outages in SaaS software are often reported in the news. [ 47 ] There are no specific software development practices that differentiate SaaS from other types of application development. [ 48 ] SaaS products are often released early and often to take advantage of the flexibility of the SaaS delivery model. [ 49 ] Agile software development is commonly used to support this release schedule. [ 50 ] Many SaaS developers use test-driven development , or otherwise emphasize frequent software testing , because of the need to ensure availability of their service and rapid deployment. [ 51 ] Domain-driven design , in which business goals drive development, is popular because SaaS products must sell themselves to the customer by being useful. [ 52 ] SaaS developers do not know in advance which devices customers will try to access the product from—such as a desktop computer, tablet, or smartphone—and supporting a wide range of devices is often an important concern for the front-end development team. [ 53 ] Progressive web applications allow some functionality to be available even if the device is offline. [ 54 ] SaaS applications predominantly offer integration protocols and application programming interfaces (APIs) that operate over a wide area network . [ 55 ] Architecture [ edit ] SaaS architecture varies significantly from product to product. [ 56 ] Nevertheless, most SaaS providers offer a multi-tenant architecture. [ 33 ] With this model, a single version of the application, with a single configuration ( hardware , network , operating system ), is used for all customers (\"tenants\"). [ 57 ] This means that the company does not need to support multiple versions and configurations. [ 18 ] The architectural shift from each customer running their own version of the software on their own hardware affects many aspects of the application's design and security features. [ 57 ] In a multi-tenant architecture, many resources can be used by different tenants or shared between multiple tenants. [ 58 ] Application and control planes of a SaaS product The structure of a typical SaaS application can be separated into application and control planes. [ 59 ] SaaS products differ in how these planes are separated, which might be closely integrated or loosely coupled in an event- or message-driven model. [ 60 ] The control plane is in charge of directing the system and covers functionality such as tenant onboarding, billing, and metrics, as well as the system used by the SaaS provider to configure, manage, and operate the service. [ 59 ] Many SaaS products are offered at different levels of service for different prices, called tiering . This can also affect the architecture for both planes, although it is commonly placed in the control plane. [ 61 ] Unlike the application plane, the services in the control plane are not designed for multitenancy. [ 62 ] An example architecture where some services are shared, while others are allocated on a per-tenant basis [ 63 ] The application plane—which varies a great deal depending on the nature of the product—implements the core functionality of the SaaS product. [ 62 ] Key design issues include separating different tenants so they cannot view or change other tenants' data or resources. [ 64 ] Except for the simplest SaaS applications, some microservices and other resources are allocated on a per-tenant basis, rather than shared between all tenants. [ 65 ] Routing functionality is necessary to direct tenant requests to the appropriate services. [ 63 ] Example SaaS deployment architecture that offers complete siloing on a premium tier and mixed microservice deployment to other tenants [ 66 ] Some SaaS products do not share any resources between tenants—called siloing. Although this negates many of the efficiency benefits of SaaS, it makes it easier to migrate legacy software to SaaS [ 67 ] and is sometimes offered as a premium offering at a higher price. [ 68 ] Pooling all resources might make it possible to achieve higher efficiency, [ 69 ] but an outage affects all customers so availability must be prioritized to a greater extent. [ 70 ] Many systems use a combination of both approaches, pooling some resources and siloing others. [ 71 ] Other companies group multiple tenants into pods and share resources between them. [ 72 ] Legal issues [ edit ] In the United States, constitutional search warrant laws do not protect all forms of SaaS dynamically stored data. The result is that governments may be able to request data from SaaS providers without the owner's consent. [ 73 ] [ 74 ] Certain open-source licenses such as GPL-2.0 do not explicitly grant rights permitting distribution as a SaaS product in Germany. [ 75 ] References [ edit ] ^ Panker, Jon; Lewis, Mark; Fahey, Evan; Vasquez, Melvin Jafet (August 2007). \"How do you pronounce IT?\" . TechTarget . Archived from the original on 28 November 2016 . Retrieved 24 May 2012 . ^ Golding 2024 , p. 14. ^ Jump up to: a b c d Dempsey & Kelliher 2018 , p. 2. ^ \"Infrastructure as a Service (IaaS) | Cloud Information Center\" . cic.gsa.gov . Retrieved 2026-01-19 . ^ Rosati & Lynn 2020 , p. 22. ^ Jump up to: a b Rosati & Lynn 2020 , p. 23. ^ Ibrahim et al. 2023 , p. 258. ^ Dempsey & Kelliher 2018 , p. 17. ^ Dempsey & Kelliher 2018 , pp. 17–18. ^ Jump up to: a b Dempsey & Kelliher 2018 , p. 19. ^ Dempsey & Kelliher 2018 , p. 33. ^ Jump up to: a b Rosati & Lynn 2020 , p. 20. ^ \"The Birth of Time-Shared Computing—Robert Fano\" . Infinite MIT . Retrieved 2026-02-02 . ^ Dempsey & Kelliher 2018 , pp. 23, 31. ^ Watt 2023 , p. 8. ^ Dempsey & Kelliher 2018 , pp. 24, 32. ^ Dempsey & Kelliher 2018 , p. 35. ^ Jump up to: a b c d Watt 2023 , p. 4. ^ Watt 2023 , pp. 4, 8. ^ Jump up to: a b Clohessy et al. 2020 , p. 40. ^ Watt 2023 , p. 9. ^ Jump up to: a b c d Dempsey & Kelliher 2018 , p. 48. ^ Kumar, Vineet (2014-05-01). \"Making \"Freemium\" Work\" . Harvard Business Review . ISSN 0017-8012 . Retrieved 2026-01-19 . ^ Dempsey & Kelliher 2018 , pp. 61–63. ^ Dempsey & Kelliher 2018 , pp. 63–64. ^ Bhandari & Gupta 2019 , p. 21. ^ Dempsey & Kelliher 2018 , pp. 48, 57. ^ Clohessy et al. 2020 , pp. 40–41. ^ Jump up to: a b Dempsey & Kelliher 2018 , p. 57. ^ Dempsey & Kelliher 2018 , pp. 57–58. ^ Dempsey & Kelliher 2018 , p. 11. ^ Jump up to: a b Dempsey & Kelliher 2018 , p. 66. ^ Jump up to: a b Garbis & Chapman 2021 , p. 185. ^ Jump up to: a b Kinnunen 2022 , pp. 123–124. ^ Golding 2024 , p. 18. ^ Golding 2024 , p. 20. ^ Watt 2023 , p. 15. ^ Watt 2023 , pp. 6, 16. ^ Jump up to: a b c Ibrahim et al. 2023 , pp. 264, 266, 268. ^ Garbis & Chapman 2021 , p. 186. ^ Kinnunen 2022 , pp. 137, 139. ^ Tallon et al. 2020 , p. 2. ^ Kinnunen 2022 , p. 124. ^ Golding 2024 , p. 25. ^ Dempsey & Kelliher 2018 , p. 36. ^ Dempsey & Kelliher 2018 , p. 37. ^ Dempsey & Kelliher 2018 , p. 39. ^ Watt 2023 , p. 11. ^ Watt 2023 , p. 16. ^ Younas et al. 2018 , p. 142. ^ Watt 2023 , pp. 11–12, 16. ^ Watt 2023 , p. 12. ^ Watt 2023 , pp. 13–14. ^ Watt 2023 , p. 13. ^ Manvi & Shyam 2021 , p. 105. ^ Golding 2024 , p. 47. ^ Jump up to: a b Golding 2024 , pp. 25–26. ^ Golding 2024 , p. 26. ^ Jump up to: a b Golding 2024 , p. 27. ^ Golding 2024 , p. 44. ^ Golding 2024 , p. 40. ^ Jump up to: a b Golding 2024 , p. 28. ^ Jump up to: a b Golding 2024 , p. 38. ^ Golding 2024 , pp. 36–37. ^ Golding 2024 , p. 37. ^ Golding 2024 , p. 76. ^ Golding 2024 , p. 55. ^ Golding 2024 , pp. 55, 74–75. ^ Golding 2024 , p. 69. ^ Golding 2024 , p. 70. ^ Golding 2024 , pp. 75–76. ^ Golding 2024 , p. 78. ^ Arthur, Charles (2010-12-14). \"Google's ChromeOS means losing control of the data, warns GNU founder Richard Stallman\" . The Guardian . UK . Archived from the original on 2014-02-28 . Retrieved 2012-02-16 . ^ Adhikari, Richard (2010-12-15). \"Why Richard Stallman Takes No Shine to Chrome\" . Linux Insider . Archived from the original on 2021-01-23 . Retrieved 2015-03-24 . ^ Ballhausen 2014 , p. 61. Sources [ edit ] Ballhausen, Miriam (2014). \"OpenSaaS: Using Free and Open Source Software as Software-as-a-Service\" . International Free and Open Source Software Law Review . 6 : 61– 68. ISSN 2666-8106 . Bhandari, Guru Prasad; Gupta, Ratneshwer (2019). \"An Overview of Cloud and Edge Computing Architecture and Its Current Issues and Challenges\". Advancing Consumer-Centric Fog Computing Architectures . IGI Global. pp. 1– 37. ISBN 978-1-5225-7149-0 . Dempsey, David; Kelliher, Felicity (2018). Industry Trends in Cloud Computing: Alternative Business-to-Business Revenue Models . Springer International Publishing. ISBN 978-3-319-87693-1 . Garbis, Jason; Chapman, Jerry W. (2021). Zero Trust Security: An Enterprise Guide . Apress. ISBN 978-1-4842-6703-5 . Golding, Tod (2024). Building Multi-Tenant SaaS Architectures . O'Reilly Media. ISBN 978-1-0981-4061-8 . Ibrahim, Ahmed Mamdouh Abdelfatah; Abdullah, Norris Syed; Bahari, Mahadi (2023). Software as a Service Challenges: A Systematic Literature Review . Springer International Publishing. pp. 257– 272. ISBN 978-3-031-18344-7 . Kinnunen, Juha (2022). ERP as Software-as-a-Service: Factors Depicting Large Enterprises Cloud Adoption . Springer International Publishing. pp. 123– 142. ISBN 978-3-030-99191-3 . Lynn, Theo; Mooney, John G.; Rosati, Pierangelo; Fox, Grace (2020). Measuring the Business Value of Cloud Computing . Springer Nature. ISBN 978-3-030-43198-3 . Tallon, Paul P.; Mooney, John G.; Duddek, Marvin (2020). \"Measuring the Business Value of IT\". Measuring the Business Value of Cloud Computing . Springer International Publishing. pp. 1– 17. ISBN 978-3-030-43198-3 . Rosati, Pierangelo; Lynn, Theo (2020). \"Measuring the Business Value of Infrastructure Migration to the Cloud\". Measuring the Business Value of Cloud Computing . Springer International Publishing. pp. 19– 37. ISBN 978-3-030-43198-3 . Clohessy, Trevor; Acton, Thomas; Morgan, Lorraine (2020). \"The SaaS Payoff: Measuring the Business Value of Provisioning Software-as-a-Service Technologies\". Measuring the Business Value of Cloud Computing . Springer International Publishing. pp. 39– 55. ISBN 978-3-030-43198-3 . Manvi, Sunilkumar; Shyam, Gopal (2021). Cloud Computing: Concepts and Technologies . CRC Press. p. 105. ISBN 9781000337952 . Watt, Andy (2023). Building Modern SaaS Applications with C# And . NET: Build, Deploy, and Maintain Professional SaaS Applications . Packt. ISBN 978-1-80461-087-9 . Younas, Muhammad; Jawawi, Dayang N. A.; Ghani, Imran; Fries, Terrence; Kazmi, Rafaqut (2018). \"Agile development in the cloud computing environment: A systematic review\" . Information and Software Technology . 103 : 142– 158. doi : 10.1016/j.infsof.2018.06.014 . ISSN 0950-5849 . Further reading [ edit ] Fox, Armando; Patterson, David A. (2020). Engineering Software As a Service: An Agile Approach Using Cloud Computing . Pogo Press. ISBN 978-1-7352338-0-2 . show v t e Software distribution Licenses Beerware Floating licensing Free and open-source Free Open source Freely redistributable License-free Proprietary Public domain Source-available Compensation models Adware Commercial software Retail software Crippleware Crowdfunding Freemium Freeware Pay what you want Careware Donationware Open-core model Postcardware Shareware Nagware Trialware Delivery methods Digital distribution File sharing On-premises Pre-installed Product bundling Retail software Sneakernet Software as a service Deceptive and/or illicit Unwanted software bundling Malware Infostealer Ransomware Spyware Trojan horse Worm Scareware Shovelware Software release life cycle Abandonware Long-term support Software maintenance Software maintainer Software publisher Vaporware list Copy protection Digital rights management Software protection dongle License manager Product activation Product key Software copyright Software license server Software patent Torrent poisoning show v t e Cloud computing Business models Content as a service Data as a service Desktop as a service Function as a service Infrastructure as a service Integration platform as a service Backend as a service Network as a service Platform as a service Security as a service Software as a service Technologies Cloud database Cloud-native computing Cloud storage Cloud storage gateways Data centers Dew computing Distributed file system for cloud Hardware virtualization Internet Mobile cloud computing Native cloud application Networking Personal cloud Security Serverless computing Structured storage Virtual appliance Web APIs Virtual private cloud Applications Box Dropbox Google Workspace Drive HP Cloud (closed) IBM Cloud Lark Microsoft Office 365 OneDrive Nextcloud OpenDesk Oracle Cloud Owncloud Proton Drive Rackspace Salesforce Seafile PlateSpin Workday Zoho Platforms Alibaba Cloud Amazon Web Services AppScale Box CloudBolt Cloud Foundry Cocaine (PaaS) Engine Yard Helion GE Predix Google App Engine GreenQloud Heroku IBM Cloud Inktank Jelastic Microsoft Azure MindSphere Netlify Oracle Cloud OutSystems openQRM OpenShift PythonAnywhere RightScale Scalr Force.com SAP Business Technology Platform Splunk Vercel vCloud Air WaveMaker Infrastructure Alibaba Cloud Amazon Web Services Abiquo Enterprise Edition CloudStack Citrix Cloud Deft DigitalOcean EMC Atmos Eucalyptus Fujitsu Google Cloud GreenButton GreenQloud IBM Cloud iland Joyent Linode Lunacloud Microsoft Azure Mirantis Netlify Nimbula Nimbus OpenIO OpenNebula OpenStack Oracle Cloud OrionVM Rackspace Cloud Safe Swiss Cloud Zadara libvirt libguestfs OVirt Virtual Machine Manager Wakame-vdc Vercel Virtual Private Cloud OnDemand Category Commons Retrieved from \" https://en.wikipedia.org/w/index.php?title=Software_as_a_service&oldid=1337107138 \" Categories : As a service Cloud applications Software delivery methods Hidden categories: Articles with short description Short description is different from Wikidata All articles with unsourced statements Articles with unsourced statements from November 2024",
        "h1_list": [],
        "h2_list": [
            "Cloud computing",
            "History",
            "Revenue models",
            "Adoption",
            "Development",
            "Legal issues",
            "References",
            "Sources",
            "Further reading"
        ],
        "h3_list": [
            "Architecture"
        ]
    }
]