[
    {
        "clean_text": "JavaScript Tutorial Menu Search field × See More Sign In ★ +1 Get Certified Upgrade Teachers Spaces Bootcamps Get Certified Upgrade Teachers Spaces Bootcamps ❮ ❯ HTML CSS JAVASCRIPT SQL PYTHON JAVA PHP HOW TO W3.CSS C C++ C# BOOTSTRAP REACT MYSQL JQUERY EXCEL XML DJANGO NUMPY PANDAS NODEJS DSA TYPESCRIPT ANGULAR ANGULARJS GIT POSTGRESQL MONGODB ASP AI R GO KOTLIN SWIFT SASS VUE GEN AI SCIPY AWS CYBERSECURITY DATA SCIENCE INTRO TO PROGRAMMING INTRO TO HTML & CSS BASH RUST Basic JavaScript JS Tutorial JS Tutorial JS Introduction JS Where To JS Output JS Syntax JS Syntax JS Statements JS Comments JS Variables JS Variables JS Let JS Const JS Types JS Operators JS Operators JS Arithmetic JS Assignment JS Comparisons JS If Conditions JS Conditional JS If JS If Else JS Ternary JS Switch JS Booleans JS Logical JS Loops JS Loops JS Loop for JS Loop while JS Break JS Continue JS Control Flow JS Strings JS Strings JS String Templates JS String Methods JS String Search JS String Reference JS Numbers JS Numbers JS Number Methods JS Number Properties JS Number Reference JS Bitwise JS BigInt JS Functions Function Study Path Function Intro Function Invocation Function Parameters Function Returns Function Arguments Function Expressions Function Arrow Function Quiz JS Objects Object Study Path Object Intro Object Properties Object Methods Object this Object Display Object Constructors JS Scope JS Scope JS Code Blocks JS Hoisting JS Strict Mode JS Dates JS Dates JS Date Formats JS Date Get JS Date Set JS Date Methods JS Temporal Dates Temporal Intro Temporal vs Date Temporal PlainDate Temporal Math JS Arrays JS Arrays JS Array Methods JS Array Search JS Array Sort JS Array Iterations JS Array Reference JS Array Const JS Sets JS Sets JS Set Methods JS Set Logic JS Set WeakSet JS Set Reference JS Maps JS Maps JS Map Methods JS Map WeakMap JS Map Reference JS Iterations JS Loops JS Iterables JS Iterators JS Generators JS Math JS Math JS Math Reference JS Math Random JS RegExp JS RegExp JS RegExp Flags JS RegExp Classes JS RegExp Metachars JS RegExp Assertions JS RegExp Quantifiers JS RegExp Patterns JS RegExp Objects JS RegExp Methods JS Data Types JS Data Types JS Primitive Data JS Object Types JS typeof JS toString() JS Type Conversion JS Errors JS Errors Intro JS Errors Silent JS Error Statements JS Error Object JS Debugging Debugging Debug Console Debug Breakpoints Debug Errors Debug Async JS Conventions JS Style Guide JS Best Practices JS Mistakes JS Performance JS References JS Keywords Reference JS Keywords Reserved JS Operator Reference JS Operator Precedence JS ECMAScript 2026 JS 2026 JS 2025 JS 2024 JS 2023 JS 2022 JS 2021 JS 2020 JS 2019 JS 2018 JS 2017 JS 2016 JS Versions JS Versions JS 2015 (ES6) JS 2009 (ES5) JS 1999 (ES3) JS IE / Edge JS History JS HTML JS HTML DOM HTML DOM HTML DOM API Selecting Elements Changing HTML Changing CSS Form Validation DOM Animations Document Reference Element Reference JS Events Intro to Events Mouse Events Keyboard Events Load Events Timing Events Manage Events Event Examples Event Listener JS Projects JS Counter JS Event Listener JS To-Do List JS Modal Popup JS Advanced JS Functions Functions Advanced Function Definitions Function Callback Function this Function Call Function Apply Function Bind Function IIFE Function Closures Function Reference Function Quiz JS Objects Object Definitions Object this Object Destructuring Object Prototypes Object Iterations Object Management Object Get / Set Object Protection Object Reference JS Classes JS Classes JS Class Inheritance JS Class Static JS Asynchronous Async Intro Async Timeouts Async Callbacks Async Promises Async Await Async Fetch Async Debug Async Reference JS Modules Modules Intro Modules Export Modules Import Modules Namespace Modules Dynamic JS Meta & Proxy Meta Programming Meta Reflect Meta Proxy Meta Reference JS Typed Arrays Typed Arrays Typed Methods Typed Reference Array Buffers DataViews JS Atomics JS DOM Navigation DOM Navigation DOM Nodes DOM Collections DOM Node Lists JS Windows JS Window JS Screen JS Location JS History JS Navigator JS Popup Alert JS Timing JS Cookies JS Web APIs Web APIs Intro Fetch API Geolocation API Web History API Web Pointer API Web Storage API Validation API Web Worker API JS AJAX AJAX Intro AJAX XMLHttp AJAX Request AJAX Response AJAX XML File AJAX PHP AJAX ASP AJAX Database AJAX Applications AJAX Examples JS JSON JSON Intro JSON Syntax JSON vs XML JSON Data Types JSON Parse JSON Stringify JSON Objects JSON Arrays JSON Server JSON PHP JSON HTML JSON JSONP JS jQuery jQuery Selectors jQuery HTML jQuery CSS jQuery DOM JS Graphics JS Graphics JS Canvas JS Plotly JS Chart.js JS Google Chart JS D3.js JS Examples JS Examples JS HTML DOM JS HTML Input JS HTML Objects JS HTML Events JS Browser JS Editor JS Exercises JS Quiz JS Website JS Syllabus JS Study Plan JS Interview Prep JS Bootcamp JS Certificate JS Reference JavaScript Tutorial ❮ Home Next ❯ Learn JavaScript The Programming Language of the Web JavaScript is easy to learn. This tutorial covers everything from basic JavaScript up to the latest 2025 version. Start learning JavaScript now » Examples in Each Chapter With our Try it Yourself editor, you can edit the source code and view \nthe result. Example My First JavaScript Click me to display Date and Time Try it Yourself » Use the Menu We recommend reading this tutorial, in the sequence listed in the menu . If you have a large screen, the menu will always be present on the left. If you have a small screen, open the menu by clicking the top menu sign ☰ . Learn by Examples Examples are better than 1000 words. Examples are often easier to understand than text explanations. This tutorial supplements all explanations with clarifying Try it Yourself examples. Note If you try all the examples, you will learn a lot about JavaScript, in a very short time! JavaScript Examples » Why Study JavaScript? JavaScript is one of the 3 languages all web developers must learn: HTML to define the content of web pages CSS to specify the layout of web pages JavaScript to program the behavior of web pages Learning Speed In this tutorial, the learning speed is your choice. Everything is up to you. If you are struggling, take a break, or re-read the material. Always make sure you understand all the \"Try-it-Yourself\" \nexamples. The only way to become a clever programmer is to: Practice coding! Practice coding! Practice coding! Commonly Asked Questions How do I get JavaScript? Where can I download JavaScript? Is JavaScript Free? You don't have to get or download JavaScript. JavaScript is already running in your browser on your computer,\non your tablet, and on your smart-phone. JavaScript is free to use for everyone. JavaScript Exercises Many chapters in this tutorial end with an exercise where you can check your level of knowledge. See all JavaScript Exercises JavaScript Quiz Test Test your JavaScript skills at W3Schools! Start JavaScript Quiz! Track Your Progress Create a W3Schools account and get access to more features and learning materials: View your completed tutorials, exercises, and quizzes Keep an eye on your progress and daily streaks Join the leaderboard and compete with others Get your own avatar and unlock new skins Create your own personal website Sign Up » Note: This is an optional feature. You can study at W3Schools without creating an account. JavaScript References W3Schools maintains a complete JavaScript reference, including all HTML and browser objects. The reference contains examples for all properties, methods and events, and \nis continuously updated according to the latest web standards. Complete JavaScript Reference » Kickstart your career Get certified by completing the course Get certified w 3 s c h o o l s C E R T I F I E D . 2 0 2 6 ❮ Home Next ❯ ★ +1 Sign in to track progress COLOR PICKER REMOVE ADS PLUS SPACES GET CERTIFIED FOR TEACHERS BOOTCAMPS CONTACT US × Contact Sales If you want to use W3Schools services as an educational institution, team or enterprise, send us an e-mail: sales@w3schools.com Report Error If you want to report an error, or if you want to make a suggestion, send us an e-mail: help@w3schools.com Top Tutorials HTML Tutorial CSS Tutorial JavaScript Tutorial How To Tutorial SQL Tutorial Python Tutorial W3.CSS Tutorial Bootstrap Tutorial PHP Tutorial Java Tutorial C++ Tutorial jQuery Tutorial Top References HTML Reference CSS Reference JavaScript Reference SQL Reference Python Reference W3.CSS Reference Bootstrap Reference PHP Reference HTML Colors Java Reference AngularJS Reference jQuery Reference Top Examples HTML Examples CSS Examples JavaScript Examples How To Examples SQL Examples Python Examples W3.CSS Examples Bootstrap Examples PHP Examples Java Examples XML Examples jQuery Examples Get Certified HTML Certificate CSS Certificate JavaScript Certificate Front End Certificate SQL Certificate Python Certificate PHP Certificate jQuery Certificate Java Certificate C++ Certificate C# Certificate XML Certificate     FORUM ABOUT ACADEMY W3Schools is optimized for learning and training. Examples might be simplified to improve reading and learning. Tutorials, references, and examples are constantly reviewed to avoid errors, but we cannot warrant full correctness of all content. While using W3Schools, you agree to have read and accepted our terms of use , cookies and privacy policy . Copyright 1999-2026 by Refsnes Data. All Rights Reserved. W3Schools is Powered by W3.CSS . -->",
        "h1_list": [
            "JavaScript Tutorial"
        ],
        "h2_list": [
            "Basic JavaScript",
            "JS HTML",
            "JS Advanced",
            "Learn JavaScript",
            "Examples in Each Chapter",
            "My First JavaScript",
            "Use the Menu",
            "Learn by Examples",
            "Note",
            "Why Study JavaScript?",
            "Learning Speed",
            "Commonly Asked Questions",
            "JavaScript Exercises",
            "JavaScript Quiz Test",
            "Track Your Progress",
            "JavaScript References",
            "Kickstart your career",
            "Contact Sales",
            "Report Error"
        ],
        "h3_list": [
            "Example"
        ]
    }
]